[
    {
        "title": "Pope Francis to be discharged from hospital on Sunday",
        "authors": [],
        "publish_date": "unknown",
        "text": "Pope Francis to be discharged from hospital\n\nPope Francis (file image) has been battling double pneumonia for more than five weeks\n\nPope Francis was never intubated and always remained alert and oriented, Dr Alfieri said. The Pope is not completely healed, but no longer has pneumonia and is now in a stable condition, according to his doctors.\n\nDuring the past five weeks, he presented \"two very critical episodes\" where his \"life was in danger\", Dr Sergio Alfieri, one of the doctors treating the P"
    },
    {
        "title": "Trump envoy Steve Witkoff dismisses Starmer plan for Ukraine",
        "authors": [],
        "publish_date": "unknown",
        "text": "Trump envoy dismisses Starmer plan for Ukraine\n\n8 hours ago Share Save James Landale • @BBCJLandale Diplomatic correspondent Reporting from Kyiv Share Save\n\nReuters Sir Keir met a group of military leaders from the \"coalition of the willing\" in the UK on Thursday\n\nSir Keir Starmer's plan for an international force to support a ceasefire in Ukraine has been dismissed as \"a posture and a pose\" by Donald Trump's special envoy. Steve Witkoff said the idea was based on a \"simplistic\" notion of the UK"
    },
    {
        "title": "The man with a mind-reading chip in his brain, thanks to Elon Musk",
        "authors": [],
        "publish_date": "unknown",
        "text": "The man with a mind-reading chip in his brain - thanks to Elon Musk\n\n6 hours ago Share Save Lara Lewington, Liv McMahon & Tom Gerken BBC News Share Save\n\nBBC\n\nHaving a chip in your brain that can translate your thoughts into computer commands may sound like science fiction - but it is a reality for Noland Arbaugh. In January 2024 - eight years after he was paralysed - the 30-year-old became the first person to get such a device from the US neurotechnology firm, Neuralink. It was not the first su"
    },
    {
        "title": "British TV industry is in crisis, says Wolf Hall director Peter Kosminsky",
        "authors": [],
        "publish_date": "unknown",
        "text": "UK TV industry in crisis, says Wolf Hall director\n\n5 hours ago Share Save Katie Razzall • @katierazz Culture and Media Editor Tom Brooks-Pollock Newsnight Share Save\n\nBBC Peter Kosminsky directed Sir Mark Rylance in the first series of Wolf Hall in 2015 and the second in 2024\n\nThe director of acclaimed period drama Wolf Hall has revealed filming of last year's second series was nearly called off weeks before it was due to begin because of budget pressures, with British TV facing a \"genuinely exi"
    },
    {
        "title": "Grassroots anger tests Nigel Farage's grip on Reform UK",
        "authors": [],
        "publish_date": "unknown",
        "text": "Grassroots anger tests Farage's grip on Reform UK\n\n15 hours ago Share Save Joshua Nevett Political reporter Joe Pike Political Investigations Correspondent Share Save\n\nGetty Images Reform UK's Nigel Farage and Zia Yusuf say they are professionalising the party\n\nReform UK leader Nigel Farage put on a brave face this week, as he sought to put a blazing row with one of the party's now suspended MPs behind him. The party is still neck-and-neck with Labour in the polls, and on Monday, it showed off 2"
    },
    {
        "title": "Balochistan: A life searching rows of unclaimed bodies for missing brothers and sons",
        "authors": [],
        "publish_date": "unknown",
        "text": "A life spent waiting - and searching rows of unclaimed bodies\n\n7 hours ago Share Save Farhat Javed BBC Urdu Reporting from Balochistan Share Save\n\nBBC/Farhat Javed Saira Baloch is among thousands of women in Balochistan seeking answers about men they say were forcibly disappeared by Pakistan's security forces\n\nSaira Baloch was 15 when she stepped into a morgue for the first time. All she heard in the dimly-lit room were sobs, whispered prayers and shuffling feet. The first body she saw was a man"
    },
    {
        "title": "Ukraine fighter pilot's wife's hopes and fears ahead of ceasefire deal",
        "authors": [],
        "publish_date": "unknown",
        "text": "'My husband is a fighter pilot in Ukraine. Here's how I really feel about a ceasefire'\n\n6 hours ago Share Save Zhanna Bezpiatchuk BBC Ukraine Reporting from Kyiv Share Save\n\nMaria Smerechanska\n\nMaria's life has been reduced to waiting for the next phone call from her husband - never knowing if it might be the last. Ivan, a 31-year-old Ukrainian fighter pilot, began defending the skies from the very first hours of Russia's full-scale invasion in February 2022, and has now flown more than 200 peri"
    },
    {
        "title": "World Happiness Report: Readers share acts of strangers' kindness",
        "authors": [],
        "publish_date": "unknown",
        "text": "'Wonderful teenagers helped my son on Halloween': Readers recall kindness of strangers\n\n5 hours ago Share Save George Sandeman BBC News Share Save\n\nFamily handout Athena Rowley and her son Robert received unexpected gifts after going trick or treating\n\nReaders have told the BBC about strangers' random acts of kindness, following research that found people underestimated the good intentions of others. In an experiment by the University of British Columbia, researchers deliberately lost wallets to"
    },
    {
        "title": "End of hedonism? Why Britain turned its back on clubbing",
        "authors": [],
        "publish_date": "unknown",
        "text": "End of hedonism? Why Britain turned its back on clubbing\n\n5 hours ago Share Save Lucy Woodham & George Hemmati BBC News Share Save\n\nBBC\n\nIn an old gun barrel factory in Sheffield's industrial heartland, hundreds of people are raving under the fluorescent lights of Hope Works club for one of the last times before it closes. One young woman has dressed all in black to signify the loss of her \"favourite place\". \"This is a landmark of Sheffield,\" says one reveller. \"It's the reason a lot of people c"
    },
    {
        "title": "Your pictures on the theme of 'my best photo'",
        "authors": [],
        "publish_date": "unknown",
        "text": "Your pictures on the theme of 'my best photo'\n\n6 hours ago Share Save Share Save\n\nWe asked our readers to send in their best pictures on the theme of \"my best photo\". Here is a selection of the photographs we received from around the world.\n\nErika Valkovicova Erika Valkovicova: \"Aurora dancing around the heart-shaped rock on Uttakleiv beach in Lofoten[, Norway].\"\n\nMatthew Logan Matthew Logan: \"These boys, brothers I assume, were fishing in a local canal on a hot summer day near Washington DC. To"
    },
    {
        "title": "Energy secretary calls for investigation in power outage near Heathrow",
        "authors": [],
        "publish_date": "unknown",
        "text": "Investigation ordered into power outage that closed Heathrow\n\n9 hours ago Share Save Hollie Cole and Tom Symonds BBC News Share Save\n\nPA Media\n\nEnergy Secretary Ed Miliband has ordered an urgent investigation into the power outage caused by a substation fire that shut Heathrow Airport on Friday. The investigation, led by the National Energy System Operator (NESO), would build a \"clear picture\" of the incident and UK's energy resilience more broadly to prevent it \"from ever happening again\", the "
    },
    {
        "title": "Fear and anger as 'battle for the soul of Romanian democracy' looms",
        "authors": [],
        "publish_date": "unknown",
        "text": "Fear and anger mount as 'battle for the soul of Romanian democracy' looms\n\n5 hours ago Share Save Sarah Rainsford Eastern Europe correspondent Reporting from Poeni, Romania Share Save\n\nBBC/Sarah Rainsford The nationalist George Simion is polling strongly in Romania ahead of elections\n\nThe Romanian village of Poeni has a couple of shops, a kebab grill and a pack of stray dogs. It also has a fair few voters who wanted a far-right candidate to become president. Poeni, just over an hour's drive from"
    },
    {
        "title": "Nigeria's IJGBs: Are those abroad widening the class divide back home?",
        "authors": [],
        "publish_date": "unknown",
        "text": "Are Nigerians abroad widening the class divide back home?\n\n5 hours ago Share Save Danai Nesta Kupemba BBC News Share Save\n\nThe Plug Entertainment Afrobeats performances during holiday periods draw in big audiences with many from the diaspora\n\nScenes playing out in Nigeria during holiday periods could be in a movie: emotional reunions at airport terminals, champagne flowing like water in high-end clubs and A-list Afrobeats performers dominating stages to packed audiences nationwide. This is when "
    },
    {
        "title": "Newspaper headlines: 'Reeves to wield axe on Civil Service' and 'boxing says bye George'",
        "authors": [],
        "publish_date": "unknown",
        "text": "'Reeves wields axe on Civil Service' and 'boxing says bye George'\n\n1 hour ago Share Save Share Save\n\nIt's just three days until Chancellor Rachel Reeves delivers her Spring Statement so it is no surprise that she is the focus on some of Sunday's front pages. \"Reeves takes axe to Civil Service\" leads the front page of the Sunday Telegraph, with the paper reporting that \"thousands of Whitehall jobs\" are expected to be slashed to help the chancellor stay on target with her spending plans. Union bos"
    },
    {
        "title": "MS Dhoni: The 43-year-old Indian cricket icon gears up for another IPL",
        "authors": [],
        "publish_date": "unknown",
        "text": "MS Dhoni: The 43-year-old Indian cricket icon gears up for another IPL\n\n6 hours ago Share Save Ayaz Memon Cricket writer Share Save\n\nAFP Dhoni, who turns 44 in July, is playing his 18th straight IPL season\n\nAs Indian Premier League (IPL) 2025 unfolds, all eyes are on MS Dhoni who continues to command superstar status in Indian cricket despite retiring from international cricket in 2020. Dhoni continues to be a key figure in the world's richest cricket league. Alongside him are veterans like Vira"
    },
    {
        "title": "Israel strikes Lebanon after first rocket attack since ceasefire",
        "authors": [],
        "publish_date": "unknown",
        "text": "Israel strikes Lebanon after first rocket attack since ceasefire\n\n10 hours ago Share Save Hugo Bachega BBC Middle East correspondent Reporting from Beirut Jaroslav Lukiv BBC News Reporting from London Share Save\n\nReuters Smoke billows from the site of Israeli strikes in southern Lebanon\n\nIsrael has carried out multiple air strikes on Lebanon after several rockets were fired from Lebanon into Israel, in the worst violence since a ceasefire came into effect in November. The Israeli military said i"
    },
    {
        "title": "Government considering sending failed asylum seekers to Balkans",
        "authors": [],
        "publish_date": "unknown",
        "text": "Government considering sending failed asylum seekers to Balkans\n\nThe prime minister has pledged to tackle the crisis of people crossing the Channel on small boats and to \"significantly\" cut net migration.\n\nThe proposals, which are at a \"very early stage\", according to a government source, would involve payments to host countries for each person removed from the UK.\n\nHome Office officials have discussed proposals to set up overseas \"return hubs\" to house asylum seekers who have had their claims r"
    },
    {
        "title": "Facebook to stop targeting ads at UK woman after legal fight",
        "authors": [],
        "publish_date": "unknown",
        "text": "Facebook to stop targeting ads at UK woman after legal fight\n\n16 hours ago Share Save Grace Dean BBC News Share Save\n\nTanya O'Carroll Facebook has agreed to stop targeting adverts at Tanya O'Carroll after she filed a lawsuit against its parent company\n\nFacebook has agreed to stop targeting adverts at an individual user using personal data after she filed a lawsuit against its parent company, tech giant Meta. Tanya O'Carroll, 37, who lives in London and works in the tech policy and human rights s"
    },
    {
        "title": "Rachel Reeves says Spring Statement will not 'tax and spend'",
        "authors": [],
        "publish_date": "unknown",
        "text": "Rachel Reeves: I will not 'tax and spend'\n\n1 day ago Share Save Laura Kuenssberg • @bbclaurak Presenter, Sunday with Laura Kuenssberg Share Save\n\nBBC The Spring Statement is fast approaching – and the chancellor faces tough choices\n\nChancellor Rachel Reeves has ruled out \"tax and spend\" policies, signalling that she will neither raise taxes nor government budgets in her critical Spring Statement next week. Speaking in a BBC documentary, The Making of a Chancellor, Reeves also warned that the gov"
    },
    {
        "title": "Turkish rally 'for justice' after mayor's detention",
        "authors": [],
        "publish_date": "unknown",
        "text": "Protesters call for 'rights, justice' after Istanbul mayor's arrest\n\n7 hours ago Share Save Emily Wither BBC News Reporting from Istanbul Zahra Fatima BBC News Reporting from London Share Save\n\nReuters Riot police clash with protesters on Saturday night in Istanbul\n\nProtests have raged on for a fourth night in Turkey following the arrest of Istanbul's mayor, part of the largest demonstrations the country has seen in more than a decade. Ekrem Imamoglu, a rival of Turkish President Recep Tayyip Er"
    },
    {
        "title": "Police burn chemicals as Hastings Half Marathon cancelled",
        "authors": [],
        "publish_date": "unknown",
        "text": "Police burn chemicals as running event cancelled\n\n11 hours ago Share Save Hsin-Yi Lo & Daniel Sexton BBC News, South East Share Save\n\nSussex Police Sussex Police they have carried out a controlled burn on chemicals found in the property\n\nOrganisers of the Hastings Half Marathon have cancelled the event after explosive chemicals were found at a property which is on part of the route. Sussex Police confirmed on Saturday they had carried out a \"controlled burn\" of the chemicals, which were discover"
    },
    {
        "title": "Wyndford Road high-rise flats demolition to alter Glasgow skyline",
        "authors": [],
        "publish_date": "unknown",
        "text": "High-rise flats demolition to alter Glasgow skyline\n\n12 hours ago Share Save Share Save\n\nBBC The 26-storey Wyndford flats will be demolished using explosives\n\nGlasgow's skyline is due to be transformed on Sunday with the demolition of three blocks of high-rise flats. The 26-storey blocks at Wyndford Road, in the north of the city, will be brought down using explosives to make way for nearly 400 new homes. An exclusion zone will be in force on Sunday morning and displaced residents will be offere"
    },
    {
        "title": "UFC London: Molly McCann retires after defeat by Alexia Thainara",
        "authors": [],
        "publish_date": "unknown",
        "text": "Molly McCann says she \"knocked on the door and opened it\" for women's MMA in Britain after announcing her retirement.\n\nMcCann, 34, was submitted in the first round by Alexia Thainara at UFC London before confirming her exit from the sport.\n\nMcCann, who has won 14 of her 22 fights across a 10-year-career, is one of Britain's most successful and high-profile women's MMA fighters in history.\n\n\"This sport has given me everything. This promotion has given me everything and it deserves that back and I"
    },
    {
        "title": "Gene Hackman and Betsy Arakawa death: New evidence in timeline",
        "authors": [],
        "publish_date": "unknown",
        "text": "Police release new evidence in timeline of Hackman and his wife's death\n\n5 days ago Share Save Samantha Granville BBC News, Los Angeles Share Save\n\nGetty Images\n\nAuthorities have discovered new information changing the timeline of when they believe Academy Award winning actor Gene Hackman and his wife, Betsy Arakawa, died. The couple were found dead in their New Mexico home last month with officials saying the pair had been dead for some time before they were discovered by neighbourhood security"
    },
    {
        "title": "What was the white balloon flying across the UK?",
        "authors": [],
        "publish_date": "unknown",
        "text": "Why was a white balloon flying across the UK?\n\n2 days ago Share Save Elliot Deady BBC News, Essex Share Save\n\nBrian Abram The gas balloon entered the UK off the coast of Clacton-on-Sea before eventually landing near Edinburgh\n\nA mysterious white balloon that was seen flying through the skies attracted the attention of hundreds of onlookers. But who was steering the carrier and why was it slowly making its way across the UK? The hydrogen-filled balloon departed Burgkirchen an der Alz, in Germany,"
    },
    {
        "title": "Stuart Everett: Killer who cut up housemate caught in chance sighting",
        "authors": [],
        "publish_date": "unknown",
        "text": "Killer who cut up housemate caught in chance sighting\n\n23 hours ago Share Save Richard Stead BBC News, Manchester Share Save\n\nGMP Forensic officers pictured searching Kersal Dale Bunker as part of the investigation\n\nA chance sighting by police helped catch the killer who murdered and dismembered his housemate before scattering body parts across Greater Manchester. Marcin Majerkiewicz has been found guilty of murdering 67-year-old Stuart Everett in a case that sparked a huge investigation and saw"
    },
    {
        "title": "Newscast - The BIG Rachel Reeves Weekend - BBC Sounds",
        "authors": [],
        "publish_date": "unknown",
        "text": "Newscast\n\nThe BIG Rachel Reeves Weekend\n\nLaura has been talking to the chancellor for a BBC documentary."
    },
    {
        "title": "The BBC News app keeps you informed with live and breaking news you can trust",
        "authors": [],
        "publish_date": "unknown",
        "text": "Click here, external to download the BBC News app from the App Store for iPhone, iPad and iPod Touch.\n\nClick here, external to download the BBC News app from Google Play for Android devices.\n\nIf you're outside the UK, you can download the BBC app here, external."
    },
    {
        "title": "Pet owners in 'shock' after dogs seized for XL bully checks",
        "authors": [],
        "publish_date": "unknown",
        "text": "Owners shocked as dogs seized for XL bully checks\n\nJust now Share Save Oscar Edwards BBC News Share Save\n\nJordan Williams Police returned Ralph to his owners after confirming he was an American bulldog\n\nTwo dog owners whose pets were confiscated by police checking for banned breeds have criticised the process around them being taken away. Natasha Goodall and her partner Jordan Williams, from Swansea, said the moment their American bulldog Ralph was seized was like having a \"child ripped away\" fr"
    },
    {
        "title": "Women's Six Nations 2025: England begin competition against Italy as World Cup on horizon",
        "authors": [],
        "publish_date": "unknown",
        "text": "Winning is the only currency John Mitchell's England work with.\n\nThe Red Roses bounce into the Women's Six Nations on a formidable 20-game winning run, eyeing a seventh title in a row.\n\nEngland have not lost since Mitchell took charge in autumn 2023 but that incredible stat will not matter if his side fail to deliver in the year of judgement.\n\nWith a home Rugby World Cup starting in August, the countdown begins to the ultimate prize in 2025.\n\nA Six Nations Grand Slam is always expected and with "
    },
    {
        "title": "Craig Bellamy: Wales boss 'Mr Calm' in Kazakhstan win - Ben Davies",
        "authors": [],
        "publish_date": "unknown",
        "text": "Wales captain Ben Davies described head coach Craig Bellamy as \"Mr Calm\" after his side made hard work of their opening World Cup qualifier to beat Kazakhstan.\n\nWales were well below their best but won 3-1 against a stubborn Kazakhstan side, who are ranked 110th in the world, in Cardiff on Saturday.\n\nBellamy had a reputation for being a fiery character during a successful but often controversial playing career at clubs such as Liverpool, Newcastle United and Manchester City.\n\nSince taking charge"
    },
    {
        "title": "Americast - Is Donald Trump ready to defy the courts? - BBC Sounds",
        "authors": [],
        "publish_date": "unknown",
        "text": "Is Donald Trump ready to defy the courts? Is Donald Trump ready to defy the courts?"
    },
    {
        "title": "Miami Open: Jack Draper beaten by Jakub Mensik in Miami Open second round",
        "authors": [],
        "publish_date": "unknown",
        "text": "British number one Jack Draper lost in straight sets to Jakub Mensik at the Miami Open in his first match since lifting the Indian Wells title.\n\nThe 23-year-old, who has risen to a career-high seventh in the world rankings, was beaten 7-6 (7-2) 7-6 (7-3) by his Czech opponent in the second round.\n\nDraper made a fine start, breaking Mensik with the first game of the match, but the 19-year-old levelled at 3-3 and was on top from then on.\n\nThe world number 54 sent down 21 aces, including four in ta"
    },
    {
        "title": "Civil Service told by government to slash running costs by 15%",
        "authors": [],
        "publish_date": "unknown",
        "text": "Civil Service told to slash running costs by 15%\n\nThe changes are part of the government's ongoing spending review, the BBC understands, with Chancellor Rachel Reeves set to deliver her Spring Statement on Wednesday.\n\nBut unions who represent rank-and-file civil servant staff are still adamant that the changes will mean significant numbers of job cuts - and have challenged ministers to be upfront about what areas of work they are prepared to stop as part of the cuts.\n\nFront-line services directl"
    },
    {
        "title": "UFC London: Sean Brady upsets Leon Edwards with dominant display",
        "authors": [],
        "publish_date": "unknown",
        "text": "Sean Brady upset Leon Edwards with a dominant display as he submitted the Briton in the fourth round of the pair's welterweight bout at UFC London.\n\nThe American, 32, out-grappled Edwards throughout before ending the contest with a guillotine choke.\n\nThe defeat is 33-year-old Edwards' second in a row after losing his welterweight title to Belal Muhammad in July.\n\n\"I took this fight the day I got out of the hospital with my wife and our newborn baby. I knew I could do that and I think I belong in"
    },
    {
        "title": "UFC London: Molly McCann retires after defeat by Alexia Thainara",
        "authors": [],
        "publish_date": "unknown",
        "text": "Molly McCann says she \"knocked on the door and opened it\" for women's MMA in Britain after announcing her retirement.\n\nMcCann, 34, was submitted in the first round by Alexia Thainara at UFC London before confirming her exit from the sport.\n\nMcCann, who has won 14 of her 22 fights across a 10-year-career, is one of Britain's most successful and high-profile women's MMA fighters in history.\n\n\"This sport has given me everything. This promotion has given me everything and it deserves that back and I"
    },
    {
        "title": "Women's Six Nations highlights: Scotland 24-21 Wales",
        "authors": [],
        "publish_date": "unknown",
        "text": "'It was like I was mugged' - Foreman reflects on Rumble in the Jungle. Video, 00:00:37'It was like I was mugged' - Foreman reflects on Rumble in the Jungle"
    }
]